[
  "obsidian-plugin-toc",
  "url-into-selection",
  "footlinks",
  "cm-editor-syntax-highlight-obsidian",
  "better-pdf-plugin",
  "table-editor-obsidian",
  "obsidian-admonition",
  "markdown-prettifier",
  "obsidian-leaflet-plugin",
  "dataview",
  "obsidian-kanban",
  "obsidian-rich-links",
  "obsidian-style-settings",
  "obsidian-annotator"
]